app/views/orders/new.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
          <h3 class="title">Checkout</h3>
          <% current_cart.cart_items.each do |cart_item| %>