app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2, "total_price" = $3 WHERE "cart_items"."id" = $4  [["quantity", 2], ["updated_at", "2024-01-08 19:07:51.220416"], ["total_price", 398], ["id", 2]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
  def create
    @cart_item = current_cart.cart_items.find_or_initialize_by(product_id: params[:product_id])
    @cart_item.quantity += 1
    @cart_item.total_price = @cart_item.product.price * @cart_item.quantity

    if @cart_item.save
      render json: {items_count: current_cart.cart_items.count}, status: 200