app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total_amount = current_cart.grand_total
    @order.status = 'order_placed'

    if @order.save
---
INSERT INTO "orders" ("user_id", "shipping_address", "total_amount", "status", "created_at", "updated_at", "payment_method") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"