app/models/order.rb

INSERT INTO "order_items" ("order_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 1], ["product_id", 1], ["quantity", 1], ["created_at", "2024-01-08 19:08:25.862182"], ["updated_at", "2024-01-08 19:08:25.862182"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
---
  def create_order_items
    cart_items = user.cart.cart_items
    cart_items.each do |cart_item|
      order_item = order_items.new
      order_item.product_id = cart_item.product_id
      order_item.quantity = cart_item.quantity

      if order_item.save
        cart_item.delete